In [3]:
import pandas as pd
df = pd.read_csv('employees.csv')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [6]:
type(df['Start Date'][0])

str

In [8]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [11]:
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [12]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-03 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-11-03 11:17:00,130590,11.858,False,Finance

In [14]:
df['Senior Management'] = df['Senior Management'].astype('bool')

In [15]:
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-03 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-11-03 11:17:00,130590,11.858,False,Finance

In [17]:
df['Gender'] = df['Gender'].astype('category')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

In [19]:
49 / 62.6

0.7827476038338658

In [22]:
import pandas as pd
df = pd.read_csv('employees.csv', parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2021-11-03 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2021-11-03 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2021-11-03 11:17:00,130590,11.858,False,Finance